dummy_questions = [
  {
    "description": "UML 다이어그램 중 순차 다이어그램에 대한 설명으로 틀린 것은?",
    "options": [
      "객체 간의 동적 상호작용을 시간 개념을 중심으로 모델링하는 것이다.",
      "주로 시스템의 정적 측면을 모델링하기 위해 사용한다.",
      "일반적으로 다이어그램의 수직 방향이 시간의 흐름을 나타낸다.",
      "회귀 메시지(Self-Message), 제어블록(Statement block) 등으로 구성된다."
    ],
    "answer": 1
  },
  {
    "description": "메시지 지향 미들웨어(Message-Oriented Middleware, MOM)에 대한 설명으로 틀린 것은?",
    "options": [
      "느리고 안정적인 응답보다는 즉각적인 응답이 필요한 온라인 업무에 적합하다.",
      "독립적인 애플리케이션을 하나의 통합된 시스템으로 묶기 위한 역할을 한다.",
      "송신측과 수신측의 연결 시 메시지 큐를 활용하는 방법이 있다.",
      "상이한 애플리케이션 간 통신을 비동기 방식으로 지원한다."
    ],
    "answer": 0
  },
  {
    "description": "익스트림 프로그래밍에 대한 설명으로 틀린 것은?",
    "options": [
      "대표적인 구조적 방법론 중 하나이다.",
      "소규모 개발 조직이 불확실하고 변경이 많은 요구를 접하였을 때 적절한 방법이다.",
      "익스트림 프로그래밍을 구동시키는 원리는 상식적인 원리와 경험을 최대한 끌어 올리는 것이다.",
      "구체적인 실천 방법을 정의하고 있으며, 개발 문서보다는 소스코드에 중점을 둔다."
    ],
    "answer": 0
  },
  {
    "description": "유스케이스(Use Case)의 구성 요소 간의 관계에 포함되지 않는 것은?",
    "options": [
      "연관",
      "확장",
      "구체화",
      "일반화"
    ],
    "answer": 0
  },
  {
    "description": "요구사항 분석에서 비기능적(Nonfunctional) 요구에 대한 설명으로 옳은 것은?",
    "options": [
      "시스템의 처리량(Throughput), 반응 시간 등의 성능 요구나 품질 요구는 비기능적 요구에 해당하지 않는다.",
      "'차량 대여 시스템이 제공하는 모든 화면이 3초 이내에 사용자에게 보여야 한다'는 비기능적 요구이다.",
      "시스템 구축과 관련된 안전, 보안에 대한 요구사항들은 비기능적 요구에 해당하지 않는다.",
      "'금융 시스템은 조회, 인출, 입금, 송금의 기능이 있어야 한다'는 비기능적 요구이다."
    ],
    "answer": 1
  },
  {
    "description": "정보공학 방법론에서 데이터베이스 설계의 표현으로 사용하는 모델링 언어는?",
    "options": [
      "Package Diagram",
      "State Transition Diagram",
      "Deployment Diagram",
      "Entity-Relationship Diagram"
    ],
    "answer": 3
  },
  {
    "description": "미들웨어(Middleware)에 대한 설명으로 틀린 것은?",
    "options": [
      "여러 운영체제에서 응용 프로그램들 사이에 위치한 소프트웨어이다.",
      "미들웨어의 서비스 이용을 위해 사용자가 정보 교환 방법 등의 내부 동작을 쉽게 확인할 수 있어야 한다.",
      "소프트웨어 컴포넌트를 연결하기 위한 준비된 인프라 구조를 제공한다.",
      "여러 컴포넌트를 1대1, 1대다, 다대다 등 여러 가지 형태로 연결이 가능하다."
    ],
    "answer": 1
  },
  {
    "description": "UI의 설계 지침으로 틀린 것은?",
    "options": [
      "이해하기 편하고 쉽게 사용할 수 있는 환경을 제공해야 한다.",
      "주요 기능을 메인 화면에 노출하여 조작이 쉽도록 하여야 한다.",
      "치명적인 오류에 대한 부정적인 사항은 사용자가 인지할 수 없도록 한다.",
      "사용자의 직무, 연령, 성별 등 다양한 계층을 수용하여야 한다."
    ],
    "answer": 2
  },
  {
    "description": "객체지향 개념에서 다형성(Polymorphism)과 관련한 설명으로 틀린 것은?",
    "options": [
      "다형성은 현재 코드를 변경하지 않고 새로운 클래스를 쉽게 추가할 수 있게 한다.",
      "다형성이란 여러 가지 형태를 가지고 있다는 의미로, 여러 형태를 받아들일 수 있는 특징을 말한다.",
      "메소드 오버라이딩(Overriding)은 상위 클래스에서 정의한 일반 메소드의 구현을 하위 클래스에서 무시하고 재정의할 수 있다.",
      "메소드 오버로딩(Overloading)의 경우 매개 변수 타입은 동일하지만 메소드명을 다르게 함으로써 구현, 구분할 수 있다."
    ],
    "answer": 3
  },
  {
    "description": "소프트웨어 개발 영역을 결정하는 요소 중 다음 사항과 관계있는 것은?",
    "options": [
      "- 소프트웨어에 의해 간접적으로 제어되는 장치와 소프트웨어를 실행하는 하드웨어",
      "- 기존의 소프트웨어와 새로운 소프트웨어를 연결하는 소프트웨어",
      "- 순서적 연산에 의해 소프트웨어를 실행하는 절차",
      "기능(Function)"
    ],
    "answer": 0
  }
]
